RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/source/cy_pra.c
        pinLoc = pinNum << CY_GPIO_DRIVE_MODE_OFFSET;
        regPolicy[index + CY_SYSLIB_DIV_ROUND((uint16_t)(cy_device->gpioPrtCfgOffset), 4U)].writeMask = (CY_GPIO_CFG_DM_MASK << pinLoc); /* CFG */

        regPolicy[index + CY_SYSLIB_DIV_ROUND((uint16_t)(cy_device->gpioPrtCfgInOffset), 4U)].writeMask = (CY_GPIO_CFG_IN_VTRIP_SEL_MASK << pinNum); /* CFG_IN */

        pinLoc = (uint32_t)(pinNum << 1u) + CY_GPIO_CFG_OUT_DRIVE_OFFSET;
        regPolicy[index + CY_SYSLIB_DIV_ROUND((uint16_t)(cy_device->gpioPrtCfgOutOffset), 4U)].writeMask = (CY_GPIO_CFG_OUT_DRIVE_SEL_MASK << pinLoc) |
                                                                                                            (CY_GPIO_CFG_OUT_SLOW_MASK << pinNum); /* CFG_OUT */

        pinLoc = (pinNum & CY_GPIO_SIO_ODD_PIN_MASK) << CY_GPIO_CFG_SIO_OFFSET;
        regPolicy[index + CY_SYSLIB_DIV_ROUND((uint16_t)(cy_device->gpioPrtCfgSioOffset), 4U)].writeMask = (CY_GPIO_VREG_EN_MASK << pinLoc);
        pinLoc = ((pinNum & CY_GPIO_SIO_ODD_PIN_MASK) << CY_GPIO_CFG_SIO_OFFSET) + CY_GPIO_IBUF_SHIFT;
        regPolicy[index + CY_SYSLIB_DIV_ROUND((uint16_t)(cy_device->gpioPrtCfgSioOffset), 4U)].writeMask |= (CY_GPIO_IBUF_MASK << pinLoc);
        pinLoc = ((pinNum & CY_GPIO_SIO_ODD_PIN_MASK) << CY_GPIO_CFG_SIO_OFFSET) + CY_GPIO_VTRIP_SEL_SHIFT;
        regPolicy[index + CY_SYSLIB_DIV_ROUND((uint16_t)(cy_device->gpioPrtCfgSioOffset), 4U)].writeMask |= (CY_GPIO_VTRIP_SEL_MASK << pinLoc);
        pinLoc = ((pinNum & CY_GPIO_SIO_ODD_PIN_MASK) << CY_GPIO_CFG_SIO_OFFSET) + CY_GPIO_VREF_SEL_SHIFT;
        regPolicy[index + CY_SYSLIB_DIV_ROUND((uint16_t)(cy_device->gpioPrtCfgSioOffset), 4U)].writeMask |= (CY_GPIO_VREF_SEL_MASK << pinLoc);
        pinLoc = ((pinNum & CY_GPIO_SIO_ODD_PIN_MASK) << CY_GPIO_CFG_SIO_OFFSET) + CY_GPIO_VOH_SEL_SHIFT;
        regPolicy[index + CY_SYSLIB_DIV_ROUND((uint16_t)(cy_device->gpioPrtCfgSioOffset), 4U)].writeMask |= (CY_GPIO_VOH_SEL_MASK << pinLoc);
    }
    else if (NULL != regPolicy)
    {
        /* regIndexToAddr Indexes are filled with NULL addresses. So don't allow to write in these indexes */
        for (uint32_t i = 0UL; i < CY_PRA_GPIO_V2_PRT_REG_NR; i++)
        {
            regPolicy[index + i].addr = NULL;
            regPolicy[index + i].writeMask = CY_PRA_REG_POLICY_WRITE_NONE;
        }
    }
    else
    {
        /* Invalid parameters */
    }
}

/*******************************************************************************
* Function Name: Cy_PRA_InitHsiomPort
****************************************************************************//**
*
* Initializes all HSIOM port register adrress and write mask
*
*******************************************************************************/
static void Cy_PRA_InitHsiomPort(cy_stc_pra_reg_policy_t *regPolicy, uint16_t index, GPIO_PRT_Type *port, uint32_t pinNum)
{
    uint32_t portNum;
    volatile uint32_t *portAddrHSIOM;

    if ((NULL != regPolicy) && (NULL != port) && CY_GPIO_IS_PIN_VALID(pinNum))
    {
        /* calculate hsiom port */
        portNum = ((uint32_t)(port) - CY_GPIO_BASE) / GPIO_PRT_SECTION_SIZE;
        portAddrHSIOM = (volatile uint32_t *)(CY_HSIOM_BASE + (HSIOM_PRT_SECTION_SIZE * portNum));

        for (uint32_t i = 0UL; i < CY_PRA_HSIOM_PRT_REG_NR; i++)
        {
            regPolicy[index + i].addr = (portAddrHSIOM + i);
        }

        if (pinNum < CY_GPIO_PRT_HALF)
        {
            regPolicy[index + CY_SYSLIB_DIV_ROUND(offsetof(HSIOM_PRT_V1_Type, PORT_SEL0), 4U)].writeMask = (CY_GPIO_HSIOM_MASK << (pinNum << CY_GPIO_HSIOM_OFFSET));
        }
        else
        {
            pinNum -= CY_GPIO_PRT_HALF;
            regPolicy[index + CY_SYSLIB_DIV_ROUND(offsetof(HSIOM_PRT_V1_Type, PORT_SEL1), 4U)].writeMask = (CY_GPIO_HSIOM_MASK << (pinNum << CY_GPIO_HSIOM_OFFSET));
        }
    }
    else if (NULL != regPolicy)
    {
        /* regIndexToAddr Indexes are filled with NULL addresses. So don't allow to write in these indexes */
        for (uint32_t i = 0UL; i < CY_PRA_HSIOM_PRT_REG_NR; i++)
        {
            regPolicy[index + i].addr = NULL;
            regPolicy[index + i].writeMask = CY_PRA_REG_POLICY_WRITE_NONE;
        }
    }
    else
    {
        /* Invalid parameters */
    }
}

#if defined(CY_DEVICE_PSOC6ABLE2)
/*******************************************************************************
* Function Name: Cy_PRA_InitAdjHsiomPort
****************************************************************************//**
*
* Initializes all adjacent HSIOM port register address and write mask
*
*******************************************************************************/
static void Cy_PRA_InitAdjHsiomPort(cy_stc_pra_reg_policy_t *regPolicy, uint16_t index, GPIO_PRT_Type *base)
{
    uint32_t portNum;
    volatile uint32_t *portAddrHSIOM;
    GPIO_PRT_Type *port;

    if ((NULL != regPolicy) && (NULL != base))
    {
        /* calculate next port address */
        port = base + 1UL;

        /* calculate hsiom port */
        portNum = ((uint32_t)(port) - CY_GPIO_BASE) / GPIO_PRT_SECTION_SIZE;
        portAddrHSIOM = (volatile uint32_t *)(CY_HSIOM_BASE + (HSIOM_PRT_SECTION_SIZE * portNum));

        for (uint32_t i = 0UL; i < CY_PRA_HSIOM_PRT_REG_NR; i++)
        {
            regPolicy[index + i].addr = (portAddrHSIOM + i);
            regPolicy[index + i].writeMask = CY_PRA_REG_POLICY_WRITE_ALL;
        }
    }
    else if (NULL != regPolicy)
    {
        /* regIndexToAddr Indexes are filled with NULL addresses. So don't allow to write in these indexes */
        for (uint32_t i = 0UL; i < CY_PRA_HSIOM_PRT_REG_NR; i++)
        {
            regPolicy[index + i].addr = NULL;
            regPolicy[index + i].writeMask = CY_PRA_REG_POLICY_WRITE_NONE;
        }
    }
    else
    {
        /* Invalid parameters */
    }
}
#endif /* defined(CY_DEVICE_PSOC6ABLE2) */

/*******************************************************************************
* Function Name: Cy_PRA_Handler
****************************************************************************//**
*
* The IPC interrupt handler on Cortex-M0+ core is called after there is a
* request from the Cortex-M4 core.
*
*******************************************************************************/
static void Cy_PRA_Handler(void)
{
    cy_stc_pra_msg_t msgLocal;
    cy_stc_pra_msg_t* msgRemote;

