RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/source/cy_pra.c
    /* Processes an internal command copy and updates the original value */
    msgRemote = (cy_stc_pra_msg_t *)Cy_IPC_Drv_ReadDataValue(Cy_IPC_Drv_GetIpcBaseAddress(CY_IPC_CHAN_PRA));

    msgLocal = *msgRemote;
    Cy_PRA_ProcessCmd(&msgLocal);
    *msgRemote = msgLocal;

    /* Clears the interrupt logic to detect a next interrupt */
    Cy_IPC_Drv_ClearInterrupt(Cy_IPC_Drv_GetIntrBaseAddr(CY_IPC_INTR_PRA), CY_PRA_IPC_NONE_INTR, CY_PRA_IPC_CHAN_INTR);

    (void) Cy_IPC_Drv_LockRelease(Cy_IPC_Drv_GetIpcBaseAddress(CY_IPC_CHAN_PRA), CY_PRA_IPC_NONE_INTR);
}


/*******************************************************************************
* Function Name: Cy_PRA_ProcessCmd
****************************************************************************//**
*
* Processes and executes the command on Cortex-M0+ which was received from
* the Cortex-M4 application.
*
* \param message cy_stc_pra_msg_t
*
*******************************************************************************/
static void Cy_PRA_ProcessCmd(cy_stc_pra_msg_t *message)
{
    static bool structInit = false;
    static cy_stc_pra_system_config_t structCpy = {0UL};

    CY_ASSERT_L1(NULL != message);


    switch (message->praCommand)
    {
        case CY_PRA_MSG_TYPE_REG32_CLR_SET:
            /* Reports an error if any of the following conditions is false:
            *  - A new value (message->praData2) has zeros in the write-protected fields
            *  - The register index is within the valid range.
            */
            if ((0U == (message->praData2 & regIndexToAddr[message->praIndex].writeMask)) &&
                (CY_PRA_REG_POLICY_WRITE_NONE != regIndexToAddr[message->praIndex].writeMask) &&
                (Cy_PRA_RegAccessRangeValid(message->praIndex)))
            {
                uint32_t tmp;

                tmp =  CY_GET_REG32(regIndexToAddr[message->praIndex].addr);

                tmp &= (message->praData1 | regIndexToAddr[message->praIndex].writeMask);
                tmp |= message->praData2;
                CY_SET_REG32(regIndexToAddr[message->praIndex].addr, tmp);
                message->praStatus = CY_PRA_STATUS_SUCCESS;
            }
            else
            {
                message->praStatus = CY_PRA_STATUS_ACCESS_DENIED;
            }
            break;

        case CY_PRA_MSG_TYPE_REG32_SET:
            /* Reports an error if any of the following conditions is false:
            *  - A new value (message->praData1) has zeros or same value in the write-protected fields
            *  - The register index is within the valid range.
            */
            if ((CY_PRA_REG_POLICY_WRITE_NONE != regIndexToAddr[message->praIndex].writeMask) &&
                (Cy_PRA_RegAccessRangeValid(message->praIndex)))
            {
                uint32_t tmp;

                tmp =  CY_GET_REG32(regIndexToAddr[message->praIndex].addr);

                if ((0U == (message->praData1 & regIndexToAddr[message->praIndex].writeMask)) ||
                    ((tmp & regIndexToAddr[message->praIndex].writeMask) ==
                    (message->praData1 & regIndexToAddr[message->praIndex].writeMask)))
                {
                    /* Clears the bits allowed to write */
                    tmp &= regIndexToAddr[message->praIndex].writeMask;

                    /* Sets the allowed bits based on the new value.
                    *  The write-protected fields have zeros in the new value, so no additional checks needed
                    */
                    tmp |= message->praData1;
                    CY_SET_REG32(regIndexToAddr[message->praIndex].addr, tmp);
                    message->praStatus = CY_PRA_STATUS_SUCCESS;
                }
                else
                {
                    message->praStatus = CY_PRA_STATUS_ACCESS_DENIED;
                }
            }
            else
            {
                message->praStatus = CY_PRA_STATUS_ACCESS_DENIED;
            }
            break;

        case CY_PRA_MSG_TYPE_REG32_GET:
            if (Cy_PRA_RegAccessRangeValid(message->praIndex))
            {
                message->praData1 = CY_GET_REG32(regIndexToAddr[message->praIndex].addr);
                message->praStatus = CY_PRA_STATUS_SUCCESS;
            }
            else
            {
                message->praStatus = CY_PRA_STATUS_ACCESS_DENIED;
            }
            break;

        case CY_PRA_MSG_TYPE_CM0_WAKEUP:
            message->praStatus = CY_PRA_STATUS_SUCCESS;
            break;

        case CY_PRA_MSG_TYPE_VERSION_CHECK:
            /* The PRA driver may not function as expected if different versions
            *  of the driver are on the Cortex-M0+ and Cortex-M4 sides.
            */
            if (((uint32_t) CY_PRA_DRV_VERSION_MAJOR == (message->praData1)) &&
                ((uint32_t) CY_PRA_DRV_VERSION_MINOR == (message->praData2)))
            {
                message->praStatus = CY_PRA_STATUS_SUCCESS;
            }
            else
            {
                message->praStatus = CY_PRA_STATUS_ERROR_PRA_VERSION;
            }
            break;

        case CY_PRA_MSG_TYPE_EXTCLK_PIN_LIST:

            if ((NULL != (cy_stc_pra_extclk_pin_t *) (message->praData1)) && ((uint32_t) (message->praData2) <= CY_PRA_EXTCLK_PIN_NR))
            {
                cy_stc_pra_extclk_pin_t *pinList =  (cy_stc_pra_extclk_pin_t *) message->praData1;
                message->praStatus = CY_PRA_STATUS_SUCCESS;

                if (extClkPolicyPtr->extClkEnable)
                {
                    pinList[CY_PRA_CLK_EXT_PIN_INDEX].port = extClkPolicyPtr->extClkPort;
                    pinList[CY_PRA_CLK_EXT_PIN_INDEX].pinNum = extClkPolicyPtr->extClkPinNum;
                    pinList[CY_PRA_CLK_EXT_PIN_INDEX].index = CY_PRA_INDX_GPIO_EXTCLK_PRT;
                    pinList[CY_PRA_CLK_EXT_PIN_INDEX].hsiomIndex = CY_PRA_INDEX_HSIOM_EXTCLK_PRT;
                }
                else
                {
                    pinList[CY_PRA_CLK_EXT_PIN_INDEX].port = NULL;
                }

                if (extClkPolicyPtr->ecoEnable)
                {
                    pinList[CY_PRA_CLK_ECO_INPIN_INDEX].port = extClkPolicyPtr->ecoInPort;
                    pinList[CY_PRA_CLK_ECO_INPIN_INDEX].pinNum = extClkPolicyPtr->ecoInPinNum;
                    pinList[CY_PRA_CLK_ECO_INPIN_INDEX].index = CY_PRA_INDX_GPIO_ECO_IN_PRT;
                    pinList[CY_PRA_CLK_ECO_INPIN_INDEX].hsiomIndex = CY_PRA_INDEX_HSIOM_ECO_IN_PRT;

                    pinList[CY_PRA_CLK_ECO_OUTPIN_INDEX].port = extClkPolicyPtr->ecoOutPort;
                    pinList[CY_PRA_CLK_ECO_OUTPIN_INDEX].pinNum = extClkPolicyPtr->ecoOutPinNum;
                    pinList[CY_PRA_CLK_ECO_OUTPIN_INDEX].index = CY_PRA_INDX_GPIO_ECO_OUT_PRT;
                    pinList[CY_PRA_CLK_ECO_OUTPIN_INDEX].hsiomIndex = CY_PRA_INDEX_HSIOM_ECO_OUT_PRT;
                }
                else
                {
                    pinList[CY_PRA_CLK_ECO_INPIN_INDEX].port = NULL;
                    pinList[CY_PRA_CLK_ECO_OUTPIN_INDEX].port = NULL;
                }

