RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/source/cy_pra.c
                if (extClkPolicyPtr->wcoEnable)
                {
                    pinList[CY_PRA_CLK_WCO_INPIN_INDEX].port = extClkPolicyPtr->wcoInPort;
                    pinList[CY_PRA_CLK_WCO_INPIN_INDEX].pinNum = extClkPolicyPtr->wcoInPinNum;
                    pinList[CY_PRA_CLK_WCO_INPIN_INDEX].index = CY_PRA_INDX_GPIO_WCO_IN_PRT;
                    pinList[CY_PRA_CLK_WCO_INPIN_INDEX].hsiomIndex = CY_PRA_INDEX_HSIOM_WCO_IN_PRT;

                    pinList[CY_PRA_CLK_WCO_OUTPIN_INDEX].port = extClkPolicyPtr->wcoOutPort;
                    pinList[CY_PRA_CLK_WCO_OUTPIN_INDEX].pinNum = extClkPolicyPtr->wcoOutPinNum;
                    pinList[CY_PRA_CLK_WCO_OUTPIN_INDEX].index = CY_PRA_INDX_GPIO_WCO_OUT_PRT;
                    pinList[CY_PRA_CLK_WCO_OUTPIN_INDEX].hsiomIndex = CY_PRA_INDEX_HSIOM_WCO_OUT_PRT;
                }
                else
                {
                    pinList[CY_PRA_CLK_WCO_INPIN_INDEX].port = NULL;
                    pinList[CY_PRA_CLK_WCO_OUTPIN_INDEX].port = NULL;
                }
            }
            else
            {
                message->praStatus = CY_PRA_STATUS_INVALID_PARAM;
            }

            break;
#if defined(CY_DEVICE_PSOC6ABLE2)
        case CY_PRA_MSG_TYPE_EXTCLK_ADJHSIOM_LIST:
            if ((NULL != (cy_stc_pra_extclk_hsiom_t *) (message->praData1)) && ((uint32_t) (message->praData2) <= CY_PRA_EXTCLK_PIN_NR))
            {
                cy_stc_pra_extclk_hsiom_t *hsiomList =  (cy_stc_pra_extclk_hsiom_t *) message->praData1;
                if (extClkPolicyPtr->extClkEnable)
                {
                    hsiomList[CY_PRA_CLK_EXT_PIN_INDEX].port = extClkPolicyPtr->extClkPort + 1; /* Fill adjacent GPIO port */
                    hsiomList[CY_PRA_CLK_EXT_PIN_INDEX].hsiomIndex = CY_PRA_INDEX_HSIOM_EXTCLK_ADJ_PRT;
                }
                else
                {
                    hsiomList[CY_PRA_CLK_EXT_PIN_INDEX].port = NULL;
                }

                if (extClkPolicyPtr->ecoEnable)
                {
                    hsiomList[CY_PRA_CLK_ECO_INPIN_INDEX].port = extClkPolicyPtr->ecoInPort + 1; /* Fill adjacent GPIO port */
                    hsiomList[CY_PRA_CLK_ECO_INPIN_INDEX].hsiomIndex = CY_PRA_INDEX_HSIOM_ECO_IN_ADJ_PRT;
                    hsiomList[CY_PRA_CLK_ECO_OUTPIN_INDEX].port = extClkPolicyPtr->ecoOutPort + 1; /* Fill adjacent GPIO port */
                    hsiomList[CY_PRA_CLK_ECO_OUTPIN_INDEX].hsiomIndex = CY_PRA_INDEX_HSIOM_ECO_OUT_ADJ_PRT;
                }
                else
                {
                    hsiomList[CY_PRA_CLK_ECO_INPIN_INDEX].port = NULL;
                    hsiomList[CY_PRA_CLK_ECO_OUTPIN_INDEX].port = NULL;
                }

                if (extClkPolicyPtr->wcoEnable)
                {
                    hsiomList[CY_PRA_CLK_WCO_INPIN_INDEX].port = extClkPolicyPtr->wcoInPort + 1; /* Fill adjacent GPIO port */
                    hsiomList[CY_PRA_CLK_WCO_INPIN_INDEX].hsiomIndex = CY_PRA_INDEX_HSIOM_WCO_IN_ADJ_PRT;
                    hsiomList[CY_PRA_CLK_WCO_OUTPIN_INDEX].port = extClkPolicyPtr->wcoOutPort + 1; /* Fill adjacent GPIO port */
                    hsiomList[CY_PRA_CLK_WCO_OUTPIN_INDEX].hsiomIndex = CY_PRA_INDEX_HSIOM_WCO_OUT_ADJ_PRT;
                }
                else
                {
                    hsiomList[CY_PRA_CLK_WCO_INPIN_INDEX].port = NULL;
                    hsiomList[CY_PRA_CLK_WCO_OUTPIN_INDEX].port = NULL;
                }

                message->praStatus = CY_PRA_STATUS_SUCCESS;
            }
            break;
#endif /* defined(CY_DEVICE_PSOC6ABLE2) */
        case CY_PRA_MSG_TYPE_SYS_CFG_FUNC:
            CY_ASSERT_L1((cy_stc_pra_system_config_t *)(message->praData1) != NULL);

            if( NULL != (cy_stc_pra_system_config_t *)(message->praData1))
            {
                bool structInitBak = structInit;
                message->praStatus = CY_PRA_STATUS_SUCCESS;

                structCpy = *((cy_stc_pra_system_config_t *)(message->praData1));

                /* Resets clocks configuration to the default state during system reset - DRIVERS-495 */
                if (0u != Cy_SysLib_GetResetReason())
                {
                    message->praStatus = Cy_PRA_ClocksReset();
                }
                /* Resets clocks configuration and backup domain to default
                 * state during hardware reset (POR, XRES, BOD)
                 */
                else if (!structInit)
                {
                    /* Resets the Backup domain on POR, XRES, BOD only if Backup domain is supplied by VDDD */
                    if ((structCpy.vBackupVDDDEnable) && (structCpy.iloEnable))
                    {
                        message->praStatus = Cy_PRA_BackupReset(structCpy.iloHibernateON);
                    }
                    message->praStatus = Cy_PRA_ClocksReset();
                }
                else
                {
                    /* Skip clock clocks configuration resetting */
                }

                if (CY_PRA_STATUS_SUCCESS == message->praStatus)
                {
                    structInit = false; /* This makes sure not to allow any CY_PRA_MSG_TYPE_FUNC_POLICY \
                                            operation during system configurations */
                    message->praStatus = Cy_PRA_SystemConfig(&structCpy);

                    structInit = structInitBak;

                    if(CY_PRA_STATUS_SUCCESS == message->praStatus)
                    {
                        structInit = true;
                    }
                }
                else
                {
                    /* Error PRA status */
                }
            }
            else
            {
                message->praStatus = CY_PRA_STATUS_INVALID_PARAM;
            }
            break;

        case CY_PRA_MSG_TYPE_SECURE_ONLY:
            switch (message->praIndex)
            {
                case CY_PRA_PM_FUNC_HIBERNATE:
                    Cy_PRA_PmHibernate(message->praData1);
                    message->praStatus = CY_PRA_STATUS_SUCCESS;
                    break;

                case CY_PRA_PM_FUNC_CM4_DP_FLAG_SET:
                    Cy_PRA_PmCm4DpFlagSet();
                    message->praStatus = CY_PRA_STATUS_SUCCESS;
                    break;

                case CY_PRA_CLK_FUNC_DS_BEFORE_TRANSITION:
                    message->praStatus = Cy_PRA_ClkDSBeforeTransition();
                    break;

                case CY_PRA_CLK_FUNC_DS_AFTER_TRANSITION:
                    message->praStatus = Cy_PRA_ClkDSAfterTransition();
                    break;

                case CY_PRA_PM_FUNC_BUCK_ENABLE_VOLTAGE2:
                    Cy_SysPm_BuckEnableVoltage2();
                    message->praStatus = CY_PRA_STATUS_SUCCESS;
                    break;

