RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/source/cy_pra.c
                case CY_PRA_PM_FUNC_BUCK_DISABLE_VOLTAGE2:
                    Cy_SysPm_BuckDisableVoltage2();
                    message->praStatus = CY_PRA_STATUS_SUCCESS;
                    break;

                case CY_PRA_PM_FUNC_BUCK_VOLTAGE2_HW_CTRL:
                    Cy_SysPm_BuckSetVoltage2HwControl((bool) message->praData1);
                    message->praStatus = CY_PRA_STATUS_SUCCESS;
                    break;

                case CY_PRA_PM_FUNC_BUCK_SET_VOLTAGE2:
                    if (CY_SYSPM_IS_BUCK_VOLTAGE2_VALID(((cy_stc_pra_voltage2_t *) message->praData1)->praVoltage))
                    {
                        Cy_SysPm_BuckSetVoltage2(((cy_stc_pra_voltage2_t *) message->praData1)->praVoltage,
                                                 ((cy_stc_pra_voltage2_t *) message->praData1)->praWaitToSettle);
                        message->praStatus = CY_PRA_STATUS_SUCCESS;
                    }
                    else
                    {
                        message->praStatus = CY_PRA_STATUS_INVALID_PARAM;
                    }
                    break;

                case CY_PRA_PM_FUNC_SRAM_MACRO_PWR_MODE:
                {
                    cy_en_syspm_sram_index_t sramNum;
                    uint32_t sramMacroNum;
                    cy_en_syspm_sram_pwr_mode_t sramPwrMode;

                    sramNum = ((cy_stc_pra_sram_power_mode_config_t *) message->praData1)->sramNum;
                    sramMacroNum = ((cy_stc_pra_sram_power_mode_config_t *) message->praData1)->sramMacroNum;
                    sramPwrMode = ((cy_stc_pra_sram_power_mode_config_t *) message->praData1)->sramPwrMode;

                    message->praStatus = Cy_PRA_ValidateSramPowerMode(sramNum, sramMacroNum, sramPwrMode);

                    if (message->praStatus == CY_PRA_STATUS_SUCCESS)
                    {
                        if (CY_SYSPM_SUCCESS != Cy_SysPm_SetSRAMMacroPwrMode(sramNum, sramMacroNum, sramPwrMode))
                        {
                            message->praStatus = CY_PRA_STATUS_INVALID_PARAM;
                        }
                    }
                    else
                    {
                        /* Not allowed to modify sram power mode */
                    }
                }
                    break;

                case CY_PRA_PM_FUNC_SRAM_PWR_MODE:
                {
                    cy_en_syspm_sram_index_t sramNum;
                    cy_en_syspm_sram_pwr_mode_t sramPwrMode;

                    sramNum = ((cy_stc_pra_sram_power_mode_config_t *) message->praData1)->sramNum;
                    sramPwrMode = ((cy_stc_pra_sram_power_mode_config_t *) message->praData1)->sramPwrMode;

                    message->praStatus = Cy_PRA_ValidateEntireSramPowerMode(sramNum, sramPwrMode);

                    if (message->praStatus == CY_PRA_STATUS_SUCCESS)
                    {
                        if (CY_SYSPM_SUCCESS != Cy_SysPm_SetSRAMPwrMode(sramNum, sramPwrMode))
                        {
                            message->praStatus = CY_PRA_STATUS_INVALID_PARAM;
                        }
                    }
                    else
                    {
                        /* Not allowed to modify sram power mode */
                    }
                }
                    break;

            #ifdef CY_IP_MXBLESS
                case CY_PRA_CLK_FUNC_PILO_INITIAL_TRIM:
                    Cy_SysClk_PiloInitialTrim();
                    message->praStatus = CY_PRA_STATUS_SUCCESS;
                    break;

                case CY_PRA_CLK_FUNC_UPDATE_PILO_TRIM_STEP:
                    Cy_SysClk_PiloUpdateTrimStep();
                    message->praStatus = CY_PRA_STATUS_SUCCESS;
                    break;
            #endif /* CY_IP_MXBLESS */

                case CY_PRA_CLK_FUNC_START_MEASUREMENT:
                {
                    cy_en_meas_clks_t clockVal1, clockVal2;
                    uint32_t countVal1;
                    clockVal1 = ((cy_stc_pra_start_clk_measurement_t *) message->praData1)->clock1;
                    clockVal2 = ((cy_stc_pra_start_clk_measurement_t *) message->praData1)->clock2;
                    countVal1 = ((cy_stc_pra_start_clk_measurement_t *) message->praData1)->count1;
                    message->praStatus = (cy_en_pra_status_t)Cy_SysClk_StartClkMeasurementCounters(clockVal1, countVal1, clockVal2);
                }
                    break;

                case CY_PRA_CLK_FUNC_ILO_TRIM:
                    message->praStatus = (cy_en_pra_status_t)Cy_SysClk_IloTrim(message->praData1);
                    break;

                case CY_PRA_CLK_FUNC_SET_PILO_TRIM:
                    Cy_SysClk_PiloSetTrim(message->praData1);
                    message->praStatus = CY_PRA_STATUS_SUCCESS;
                    break;

            #if defined(CY_IP_MXBLESS)
                case CY_PRA_BLE_CLK_FUNC_ECO_CONFIGURE:
                    structCpy.altHFcLoad = ((cy_stc_pra_ble_eco_config_t *) message->praData1)->cLoad;
                    structCpy.altHFxtalStartUpTime = ((cy_stc_pra_ble_eco_config_t *) message->praData1)->xtalStartUpTime;
                    structCpy.altHFclkFreq = (uint32_t)((cy_stc_pra_ble_eco_config_t *) message->praData1)->freq;
                    structCpy.altHFsysClkDiv = (uint32_t)((cy_stc_pra_ble_eco_config_t *) message->praData1)->sysClkDiv;
                    structCpy.altHFvoltageReg = (uint32_t)((cy_stc_pra_ble_eco_config_t *) message->praData1)->voltageReg;
                    structCpy.clkAltHfEnable = true;

                    message->praStatus = (cy_en_pra_status_t)Cy_BLE_EcoConfigure(
                                                                (cy_en_ble_eco_freq_t)structCpy.altHFclkFreq,
                                                                (cy_en_ble_eco_sys_clk_div_t)structCpy.altHFsysClkDiv,
                                                                structCpy.altHFcLoad,
                                                                structCpy.altHFxtalStartUpTime,
                                                                (cy_en_ble_eco_voltage_reg_t)structCpy.altHFvoltageReg);
                    break;

                case CY_PRA_BLE_CLK_FUNC_ECO_RESET:
                    Cy_BLE_EcoReset();
                    message->praStatus = CY_PRA_STATUS_SUCCESS;
                    break;
            #endif /* CY_IP_MXBLESS */

                default:
                    message->praStatus = CY_PRA_STATUS_ACCESS_DENIED;
                    break;
            }
            break;

        case CY_PRA_MSG_TYPE_FUNC_POLICY:
            if(structInit)
            {
                switch (message->praIndex)
                {
                    case CY_PRA_PM_FUNC_LDO_SET_VOLTAGE:
                    {
                        bool powerEnableTmp, ldoEnableTmp, ulpEnableTmp;
                        powerEnableTmp = structCpy.powerEnable; /* old value backup */
                        ldoEnableTmp = structCpy.ldoEnable; /* old value backup */
                        ulpEnableTmp = structCpy.ulpEnable; /* old value backup */
                        structCpy.powerEnable = true;
                        structCpy.ldoEnable = true;
                        structCpy.ldoVoltage = (cy_en_syspm_ldo_voltage_t)message->praData1;
                        if (structCpy.ldoVoltage == CY_SYSPM_LDO_VOLTAGE_0_9V)
                        {
                            structCpy.ulpEnable = true;
                        }
                        else
                        {
                            structCpy.ulpEnable = false;
                        }
                        if (CY_PRA_SKIP_SYS_CFG != message->praData2)
                        {
                            message->praStatus = Cy_PRA_SystemConfig(&structCpy);
                            if (message->praStatus != CY_PRA_STATUS_SUCCESS)
                            {
                                /* On failure, previous values are restored */
                                structCpy.powerEnable = powerEnableTmp;
                                structCpy.ldoEnable = ldoEnableTmp;
                                structCpy.ulpEnable = ulpEnableTmp;
                            }
                        }
                        else
                        {
                            message->praStatus = CY_PRA_STATUS_SUCCESS;
                        }
                    }
                    break;

                    case CY_PRA_PM_FUNC_BUCK_ENABLE:
                    {
                        bool powerEnableTmp, ldoEnableTmp, ulpEnableTmp;
                        powerEnableTmp = structCpy.powerEnable; /* Old value backup */
                        ldoEnableTmp = structCpy.ldoEnable; /* Old value backup */
                        ulpEnableTmp = structCpy.ulpEnable; /* Old value backup */
                        structCpy.powerEnable = true;
                        structCpy.ldoEnable = false;
                        structCpy.buckVoltage = (cy_en_syspm_buck_voltage1_t)message->praData1;
                        if (structCpy.buckVoltage == CY_SYSPM_BUCK_OUT1_VOLTAGE_0_9V)
                        {
                            structCpy.ulpEnable = true;
                        }
                        else
                        {
                            structCpy.ulpEnable = false;
                        }
                        if (CY_PRA_SKIP_SYS_CFG != message->praData2)
                        {
                            message->praStatus = Cy_PRA_SystemConfig(&structCpy);
                            if (message->praStatus != CY_PRA_STATUS_SUCCESS)
                            {
                                /* On failure, previous values are restored */
                                structCpy.powerEnable = powerEnableTmp;
                                structCpy.ldoEnable = ldoEnableTmp;
                                structCpy.ulpEnable = ulpEnableTmp;
                            }
                        }
                        else
                        {
                            message->praStatus = CY_PRA_STATUS_SUCCESS;
                        }
                    }
                    break;

                    case CY_PRA_PM_FUNC_SET_MIN_CURRENT:
                    {
                        bool powerEnableTmp, pwrCurrentModeMinTmp;
                        /* Backups old values */
                        powerEnableTmp = structCpy.powerEnable;
                        pwrCurrentModeMinTmp = structCpy.pwrCurrentModeMin;
                        structCpy.powerEnable = true;
                        structCpy.pwrCurrentModeMin = true;
                        if (CY_PRA_SKIP_SYS_CFG != message->praData2)
                        {
                            message->praStatus = Cy_PRA_SystemConfig(&structCpy);
                            if (message->praStatus != CY_PRA_STATUS_SUCCESS)
                            {
                                /* On failure, previous values are restored */
                                structCpy.powerEnable = powerEnableTmp;
                                structCpy.pwrCurrentModeMin = pwrCurrentModeMinTmp;
                            }
                        }
                        else
                        {
                            message->praStatus = CY_PRA_STATUS_SUCCESS;
                        }
                    }
                    break;

                    case CY_PRA_PM_FUNC_SET_NORMAL_CURRENT:
                    {
                        bool powerEnableTmp, pwrCurrentModeMinTmp;
                        /* Backups old values */
                        powerEnableTmp = structCpy.powerEnable;
                        pwrCurrentModeMinTmp = structCpy.pwrCurrentModeMin;
                        structCpy.powerEnable = true;
                        structCpy.pwrCurrentModeMin = false;
                        if (CY_PRA_SKIP_SYS_CFG != message->praData2)
                        {
                            message->praStatus = Cy_PRA_SystemConfig(&structCpy);
                            if (message->praStatus != CY_PRA_STATUS_SUCCESS)
                            {
                                /* On failure, previous values are restored */
                                structCpy.powerEnable = powerEnableTmp;
                                structCpy.pwrCurrentModeMin = pwrCurrentModeMinTmp;
                            }
                        }
                        else
                        {
                            message->praStatus = CY_PRA_STATUS_SUCCESS;
                        }
                    }
                    break;

