RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/source/cy_pra.c
                    case CY_PRA_CLK_FUNC_PLL_ENABLE:
                    {
                        if ((((message->praData1) == CY_PRA_CLKPLL_1) && (structCpy.pll0Enable == true))
                            || (((message->praData1) == CY_PRA_CLKPLL_2) && (structCpy.pll1Enable == true))
                            || (message->praData1 > CY_SRSS_NUM_PLL) || (message->praData1 == 0UL))
                        {
                            message->praStatus = CY_PRA_STATUS_ERROR_PROCESSING_PLL_ENABLED;
                        }
                        else
                        {
                            /* PLL Enable API does not contain the PLL output value
                             * as the argument. So, calculate and update the PLL output value */
                            if ((message->praData1) == CY_PRA_CLKPLL_1)
                            {
                                structCpy.pll0OutFreqHz = Cy_PRA_CalculatePLLOutFreq(CY_PRA_CLKPLL_1, &structCpy);
                                structCpy.pll0Enable = true;
                            }
                            else
                            {
                                structCpy.pll1OutFreqHz = Cy_PRA_CalculatePLLOutFreq(CY_PRA_CLKPLL_2, &structCpy);
                                structCpy.pll1Enable = true;
                            }
                            if (CY_PRA_SKIP_SYS_CFG != message->praData2)
                            {
                                message->praStatus = Cy_PRA_SystemConfig(&structCpy);

                                if (message->praStatus != CY_PRA_STATUS_SUCCESS)
                                {
                                    if ((message->praData1) == CY_PRA_CLKPLL_1)
                                    {
                                        structCpy.pll0OutFreqHz = CY_PRA_DEFAULT_ZERO;
                                        structCpy.pll0Enable = false;
                                    }
                                    else
                                    {
                                        structCpy.pll1OutFreqHz = CY_PRA_DEFAULT_ZERO;
                                        structCpy.pll1Enable = false;
                                    }
                                }
                                else /* PLL is enabled successfully */
                                {
                                    /* Check if PLL0 or PLL1 is source to HF0 */
                                    if ((structCpy.hf0Source == CY_SYSCLK_CLKHF_IN_CLKPATH1) || (structCpy.hf0Source == CY_SYSCLK_CLKHF_IN_CLKPATH2))
                                    {
                                        /* Update HF0 output frequency */
                                        structCpy.hf0OutFreqMHz = CY_SYSLIB_DIV_ROUND(Cy_SysClk_ClkPathGetFrequency((uint32_t) structCpy.hf0Source), ((1UL << (uint32_t)structCpy.hf0Divider) * CY_PRA_FREQUENCY_HZ_CONVERSION));
                                    }
                                }
                            } /* (CY_PRA_SKIP_SYS_CFG != message->praData2) */
                            else
                            {
                                message->praStatus = CY_PRA_STATUS_SUCCESS;
                            }

                        }
                    }
                    break;

                    case CY_PRA_CLK_FUNC_SLOW_SET_DIVIDER:
                    {
                        uint8_t clkSlowDivTmp;
                        bool clkSlowEnableTmp;
                        /* Backups old values */
                        clkSlowEnableTmp = structCpy.clkSlowEnable;
                        clkSlowDivTmp = structCpy.clkSlowDiv;
                        structCpy.clkSlowEnable = true;
                        structCpy.clkSlowDiv = (uint8_t)(message->praData1);
                        if (CY_PRA_SKIP_SYS_CFG != message->praData2)
                        {
                            message->praStatus = Cy_PRA_SystemConfig(&structCpy);
                            if (message->praStatus != CY_PRA_STATUS_SUCCESS)
                            {
                                /* On failure, previous path values are restored */
                                structCpy.clkSlowDiv = clkSlowDivTmp;
                                structCpy.clkSlowEnable = clkSlowEnableTmp;
                            }
                        }
                        else
                        {
                            message->praStatus = CY_PRA_STATUS_SUCCESS;
                        }
                    }
                    break;

                    case CY_PRA_CLK_FUNC_EXT_CLK_SET_FREQUENCY:
                    {
                        structCpy.extClkEnable = true;
                        structCpy.extClkFreqHz = (uint32_t)(message->praData1);
                        message->praStatus = CY_PRA_STATUS_SUCCESS;
                    }
                    break;

                    default:
                        message->praStatus = CY_PRA_STATUS_ACCESS_DENIED;
                        break;
                }
            }
            else
            {
                message->praStatus = CY_PRA_STATUS_ACCESS_DENIED;
            }
            break;

        default:
            message->praStatus = CY_PRA_STATUS_ACCESS_DENIED;
           break;
    }

}
#endif /* (CY_CPU_CORTEX_M0P) */



/*******************************************************************************
* Function Name: Cy_PRA_SendCmd
****************************************************************************//**
*
* Takes the parameters, passes them to the secure Cortex-M0+ via IPC, waits for
* Cortex-M0+ to finish and reports the status.
*
* \param cmd The command to execute on the secure side. The macros for this
* parameter are defined in the cy_pra.h file with the CY_PRA_MSG_TYPE_ prefix.
* \param regIndex The index of the function or register depending on the command
* parameter. The macros for this parameter are defined in the cy_pra.h file with
* the CY_PRA_INDX_ prefix.
* \param clearMask Data sent to secure the core.
* \param setMask Additional data send to secure the core.
*
* \return The command execution status. For the register read command, the read
* value is returned.
*
*******************************************************************************/
#if defined(CY_DEVICE_PSOC6ABLE2)

    CY_SECTION_RAMFUNC_BEGIN
    #if !defined (__ICCARM__)
        CY_NOINLINE
    #endif
#endif /* defined(CY_DEVICE_PSOC6ABLE2) */
    cy_en_pra_status_t Cy_PRA_SendCmd(uint16_t cmd, uint16_t regIndex, uint32_t clearMask, uint32_t setMask)
    {
        cy_en_pra_status_t status;
    #if (CY_CPU_CORTEX_M0P)
        /* update structCpy variable */
        CY_ALIGN(4UL)cy_stc_pra_msg_t msgLocal;

        msgLocal.praCommand = cmd;
        msgLocal.praStatus  = CY_PRA_STATUS_REQUEST_SENT;
        msgLocal.praIndex   = regIndex;
        msgLocal.praData1   = clearMask;

        if (cmd == CY_PRA_MSG_TYPE_FUNC_POLICY)
        {
            msgLocal.praData2   = CY_PRA_SKIP_SYS_CFG;
            Cy_PRA_ProcessCmd(&msgLocal);
            status = CY_PRA_STATUS_SUCCESS;
            (void)setMask;
        }
        else if ((cmd == CY_PRA_MSG_TYPE_SYS_CFG_FUNC) && (regIndex == CY_PRA_FUNC_INIT_CYCFG_DEVICE))
        {
            msgLocal.praData2   = setMask;
            Cy_PRA_ProcessCmd(&msgLocal);
            status = (cy_en_pra_status_t) msgLocal.praStatus;
        }
        else
        {
            status = CY_PRA_STATUS_ACCESS_DENIED;
            (void)cmd;
            (void)regIndex;
            (void)clearMask;
            (void)setMask;
        }
    #else
        CY_ASSERT_L1(NULL != ipcPraBase);


        CY_ALIGN(4UL) cy_stc_pra_msg_t ipcMsg;
        uint32_t interruptState;

        ipcMsg.praCommand = cmd;
        ipcMsg.praStatus  = CY_PRA_STATUS_REQUEST_SENT;
        ipcMsg.praIndex   = regIndex;
        ipcMsg.praData1   = clearMask;
        ipcMsg.praData2   = setMask;

