RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/source/cy_pra.c
        interruptState = Cy_SysLib_EnterCriticalSection();

        while (0U == _FLD2VAL(IPC_STRUCT_ACQUIRE_SUCCESS, REG_IPC_STRUCT_ACQUIRE(ipcPraBase)))
        {
            /* Waits until the PRA IPC structure is acquired */
        }

        /* Sends the message */
        REG_IPC_STRUCT_DATA(ipcPraBase) = (uint32_t) &ipcMsg;

        /* Generates an acquire notification event by the PRA IPC interrupt structure */
        REG_IPC_STRUCT_NOTIFY(ipcPraBase) = _VAL2FLD(IPC_STRUCT_NOTIFY_INTR_NOTIFY, CY_PRA_IPC_NOTIFY_INTR);

        while (0U != _FLD2VAL(IPC_STRUCT_ACQUIRE_SUCCESS, REG_IPC_STRUCT_LOCK_STATUS(ipcPraBase)))
        {
            /* Waits until the PRA IPC structure is released */
        }

        Cy_SysLib_ExitCriticalSection(interruptState);

        /* Cortex-M0+ has an updated ipcMsg variable */

        status = (cy_en_pra_status_t) ipcMsg.praStatus;

        if (CY_PRA_STATUS_ACCESS_DENIED == status)
        {
            CY_HALT();
        }

        if (CY_PRA_MSG_TYPE_SYS_CFG_FUNC == ipcMsg.praCommand)
        {
        #if defined(CY_IP_MXBLESS)
            /* Update cy_BleEcoClockFreqHz for the proper Cy_SysLib_Delay functionality */
            if(((cy_stc_pra_system_config_t *) clearMask)->altHFclkFreq == CY_BLE_BLESS_ECO_FREQ_32MHZ)
            {
                cy_BleEcoClockFreqHz = CY_PRA_ALTHF_FREQ_32MHZ / (1UL << ((cy_stc_pra_system_config_t *) clearMask)->altHFsysClkDiv);
            }
            else
            {
                cy_BleEcoClockFreqHz = CY_PRA_ALTHF_FREQ_16MHZ / (1UL << ((cy_stc_pra_system_config_t *) clearMask)->altHFsysClkDiv);
            }

            if(((cy_stc_pra_system_config_t *) clearMask)->clkAltHfEnable == false)
            {
                cy_BleEcoClockFreqHz = 0UL;
            }
        #endif /* defined(CY_IP_MXBLESS) */

            cySysClkExtFreq = ((cy_stc_pra_system_config_t *) clearMask)->extClkFreqHz;

            SystemCoreClockUpdate();
        }

        if (CY_PRA_MSG_TYPE_REG32_GET == ipcMsg.praCommand)
        {
            status = (cy_en_pra_status_t)ipcMsg.praData1;
        }

    #endif /* (CY_CPU_CORTEX_M0P) */

        return status;
    }
#if defined(CY_DEVICE_PSOC6ABLE2)
    CY_SECTION_RAMFUNC_END
#endif /* defined(CY_DEVICE_PSOC6ABLE2) */

#if (CY_CPU_CORTEX_M4) || defined (CY_DOXYGEN)
/*******************************************************************************
* Function Name: Cy_PRA_GetPinProtType
****************************************************************************//**
*
* Find the matching PORT and PIN number from External clock secure PIN list and
* returns protection status of the PIN.
*
*******************************************************************************/
    cy_en_pra_pin_prot_type_t Cy_PRA_GetPinProtType(GPIO_PRT_Type *base, uint32_t pinNum)
    {
        uint32_t index;
        cy_en_pra_pin_prot_type_t pinType = CY_PRA_PIN_SECURE_NONE;

        if ((NULL != base) && (CY_GPIO_IS_PIN_VALID(pinNum)))
        {
            for (index=0; index<CY_PRA_EXTCLK_PIN_NR; index++)
            {
                if (secExtclkPinList[index].port == base)
                {
                    pinType = CY_PRA_PIN_SECURE_UNCONSTRAINED;

                    if (secExtclkPinList[index].pinNum == pinNum)
                    {
                        pinType = CY_PRA_PIN_SECURE;
                        break;
                    }
                }
            }
        }

        return pinType;
    }

/*******************************************************************************
* Function Name: Cy_PRA_IsPortSecure
****************************************************************************//**
*
* Find the matching PORT from External clock secure PIN list and returns
* protection status of the PORT.
*
*******************************************************************************/
    bool Cy_PRA_IsPortSecure(GPIO_PRT_Type *base)
    {
        uint32_t index;
        bool retPort = false;
        if (NULL != base)
        {
            for (index=0; index<CY_PRA_EXTCLK_PIN_NR; index++)
            {
                if (secExtclkPinList[index].port == base)
                {
                    retPort = true;
                    break;
                }
            }
        }

        return retPort;
    }

#if defined(CY_DEVICE_PSOC6ABLE2)
/*******************************************************************************
* Function Name: Cy_PRA_IsHsiomSecure
****************************************************************************//**
*
* Find the matching PORT from External clock adjacent HSIOM list and returns
* protection status of the PORT.
*
*******************************************************************************/
    bool Cy_PRA_IsHsiomSecure(GPIO_PRT_Type *base)
    {
        uint32_t index;
        bool retPort = false;
        if (NULL != base)
        {
            for (index=0; index<CY_PRA_EXTCLK_PIN_NR; index++)
            {
                if (secExtClkAdjHsiomList[index].port == base)
                {
                    retPort = true;
                    break;
                }
            }
        }

        return retPort;
    }

#endif /* defined(CY_DEVICE_PSOC6ABLE2) */

/*******************************************************************************
* Function Name: Cy_PRA_GetPortRegIndex
****************************************************************************//**
*
* Find the matching PORT and PIN number from External clock secure PIN list and
* returns port address index
*
*******************************************************************************/
    uint16_t Cy_PRA_GetPortRegIndex(GPIO_PRT_Type *base, uint16_t subIndex)
    {
        uint32_t index;
        uint16_t portIndex;
        uint16_t retIndex = CY_PRA_REG_INDEX_COUNT; /* assigned with invalid index */

        if (NULL != base)
        {
            for (index=0; index<CY_PRA_EXTCLK_PIN_NR; index++)
            {
                if (secExtclkPinList[index].port == base)
                {
                    portIndex = secExtclkPinList[index].index;

