RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/source/cy_pra.c
                    switch (subIndex)
                    {
                        case CY_PRA_SUB_INDEX_PORT_OUT:
                        retIndex = portIndex + CY_SYSLIB_DIV_ROUND(offsetof(GPIO_PRT_Type, OUT), 4U);
                        break;
                        case CY_PRA_SUB_INDEX_PORT_OUT_CLR:
                        retIndex = portIndex + CY_SYSLIB_DIV_ROUND(offsetof(GPIO_PRT_Type, OUT_CLR), 4U);
                        break;
                        case CY_PRA_SUB_INDEX_PORT_OUT_SET:
                        retIndex = portIndex + CY_SYSLIB_DIV_ROUND(offsetof(GPIO_PRT_Type, OUT_SET), 4U);
                        break;
                        case CY_PRA_SUB_INDEX_PORT_OUT_INV:
                        retIndex = portIndex + CY_SYSLIB_DIV_ROUND(offsetof(GPIO_PRT_Type, OUT_INV), 4U);
                        break;
                        case CY_PRA_SUB_INDEX_PORT_IN:
                        retIndex = portIndex + CY_SYSLIB_DIV_ROUND(offsetof(GPIO_PRT_Type, IN), 4U);
                        break;
                        case CY_PRA_SUB_INDEX_PORT_INTR:
                        retIndex = portIndex + CY_SYSLIB_DIV_ROUND(offsetof(GPIO_PRT_Type, INTR), 4U);
                        break;
                        case CY_PRA_SUB_INDEX_PORT_INTR_MASK:
                        retIndex = portIndex + CY_SYSLIB_DIV_ROUND(offsetof(GPIO_PRT_Type, INTR_MASK), 4U);
                        break;
                        case CY_PRA_SUB_INDEX_PORT_INTR_MASKED:
                        retIndex = portIndex + CY_SYSLIB_DIV_ROUND(offsetof(GPIO_PRT_Type, INTR_MASKED), 4U);
                        break;
                        case CY_PRA_SUB_INDEX_PORT_INTR_SET:
                        retIndex = portIndex + CY_SYSLIB_DIV_ROUND(offsetof(GPIO_PRT_Type, INTR_SET), 4U);
                        break;
                        case CY_PRA_SUB_INDEX_PORT_INTR_CFG:
                        retIndex = portIndex + CY_SYSLIB_DIV_ROUND((uint16_t)(cy_device->gpioPrtIntrCfgOffset), 4U);
                        break;
                        case CY_PRA_SUB_INDEX_PORT_CFG:
                        retIndex = portIndex + CY_SYSLIB_DIV_ROUND((uint16_t)(cy_device->gpioPrtCfgOffset), 4U);
                        break;
                        case CY_PRA_SUB_INDEX_PORT_CFG_IN:
                        retIndex = portIndex + CY_SYSLIB_DIV_ROUND((uint16_t)(cy_device->gpioPrtCfgInOffset), 4U);
                        break;
                        case CY_PRA_SUB_INDEX_PORT_CFG_OUT:
                        retIndex = portIndex + CY_SYSLIB_DIV_ROUND((uint16_t)(cy_device->gpioPrtCfgOutOffset), 4U);
                        break;
                        case CY_PRA_SUB_INDEX_PORT_CFG_SIO:
                        retIndex = portIndex + CY_SYSLIB_DIV_ROUND((uint16_t)(cy_device->gpioPrtCfgSioOffset), 4U);
                        break;
                        default:
                        retIndex = CY_PRA_REG_INDEX_COUNT;
                        break;
                    }

                    break;
                }
            }
        }
        return retIndex;
    }

/*******************************************************************************
* Function Name: Cy_PRA_GetHsiomRegIndex
****************************************************************************//**
*
* Find the matching PORT address from External clock secure PIN list and
* returns HSIOM port address index
*
*******************************************************************************/
    uint16_t Cy_PRA_GetHsiomRegIndex(GPIO_PRT_Type *base, uint16_t subIndex)
    {
        uint32_t index;
        uint16_t hsiomIndex;
        uint16_t retIndex = CY_PRA_REG_INDEX_COUNT; /* assigned with invalid index */

        if (NULL != base)
        {
            for (index=0; index<CY_PRA_EXTCLK_PIN_NR; index++)
            {
                if (secExtclkPinList[index].port == base)
                {
                    hsiomIndex = secExtclkPinList[index].hsiomIndex;

                    switch (subIndex)
                    {
                        case CY_PRA_SUB_INDEX_HSIOM_PORT0:
                        retIndex = hsiomIndex + CY_SYSLIB_DIV_ROUND(offsetof(HSIOM_PRT_V1_Type, PORT_SEL0), 4U);
                        break;
                        case CY_PRA_SUB_INDEX_HSIOM_PORT1:
                        retIndex = hsiomIndex + CY_SYSLIB_DIV_ROUND(offsetof(HSIOM_PRT_V1_Type, PORT_SEL1), 4U);
                        break;
                        default:
                        retIndex = CY_PRA_REG_INDEX_COUNT;
                        break;
                    }
                    break;
                }
            }
        }
        return retIndex;
    }

#if defined(CY_DEVICE_PSOC6ABLE2)
/*******************************************************************************
* Function Name: Cy_PRA_GetAdjHsiomRegIndex
****************************************************************************//**
*
* Find the matching PORT address from External clock adjacent hsiom list and
* returns HSIOM port address index
*
*******************************************************************************/
    uint16_t Cy_PRA_GetAdjHsiomRegIndex(GPIO_PRT_Type *base, uint16_t subIndex)
    {
        uint32_t index;
        uint16_t hsiomIndex;
        uint16_t retIndex = CY_PRA_REG_INDEX_COUNT; /* assigned with invalid index */

        if (NULL != base)
        {
            for (index=0; index<CY_PRA_EXTCLK_PIN_NR; index++)
            {
                if (secExtClkAdjHsiomList[index].port == base)
                {
                    hsiomIndex = secExtClkAdjHsiomList[index].hsiomIndex;

                    switch (subIndex)
                    {
                        case CY_PRA_SUB_INDEX_HSIOM_PORT0:
                        retIndex = hsiomIndex + CY_SYSLIB_DIV_ROUND(offsetof(HSIOM_PRT_V1_Type, PORT_SEL0), 4U);
                        break;
                        case CY_PRA_SUB_INDEX_HSIOM_PORT1:
                        retIndex = hsiomIndex + CY_SYSLIB_DIV_ROUND(offsetof(HSIOM_PRT_V1_Type, PORT_SEL1), 4U);
                        break;
                        default:
                        retIndex = CY_PRA_REG_INDEX_COUNT;
                        break;
                    }
                    break;
                }
            }
        }
        return retIndex;
    }
#endif /* defined(CY_DEVICE_PSOC6ABLE2) */

