RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/source/cy_pra.c
    return CY_PRA_STATUS_SUCCESS;
}

/*******************************************************************************
* Function Name: Cy_PRA_ClkDSAfterTransition
****************************************************************************//**
*
* SysClock after Deep Sleep transition.
*
*******************************************************************************/
static cy_en_pra_status_t Cy_PRA_ClkDSAfterTransition(void)
{
    /* Bit-mapped paths with enabled FLL/PLL sourced by ECO */
    uint32_t timeout = CY_PRA_TIMEOUT;
    cy_en_pra_status_t retVal = CY_PRA_STATUS_ERROR_SYSPM_TIMEOUT;

    /* After return from Deep Sleep, for each FLL/PLL, if needed, restore the source to ECO.
     * And block until the FLL/PLL has regained its frequency lock.
     */
    if (0U != changedSourcePaths)
    {
        /* If any FLL/PLL was sourced by the ECO, the timeout waits for the ECO to become fully stabilized again */
        while ((CY_SYSCLK_ECOSTAT_STABLE != Cy_SysClk_EcoGetStatus()) && (0UL != timeout))
        {
            timeout--;
        }

        if (0UL != timeout)
        {
            uint32_t fllPll; /* 0 = FLL, all other values = PLL */

            for (fllPll = 0UL; fllPll <= CY_SRSS_NUM_PLL; fllPll++)
            {
                /* If there is a correspondent record about a changed clock source */
                if (0U != (changedSourcePaths & (uint16_t)(1UL << fllPll)))
                {
                    /* Changes this path source back to ECO */
                    (void)Cy_SysClk_ClkPathSetSource(fllPll, CY_SYSCLK_CLKPATH_IN_ECO);

                    /* The timeout waits for FLL/PLL to regain a lock.
                     * Split FLL and PLL lock polling loops into two separate threads to minimize one polling loop duration.
                     */
                    if (0UL == fllPll)
                    {
                        while ((!Cy_SysClk_FllLocked()) && (0UL != timeout))
                        {
                            timeout--;
                        }
                    }
                    else
                    {
                        while ((!Cy_SysClk_PllLocked(fllPll)) && (0UL != timeout))
                        {
                            timeout--;
                        }
                    }

                    if (0UL != timeout)
                    {
                        /* Undoes the bypass for FLL/PLL */
                        if (0UL == fllPll)
                        {
                            CY_REG32_CLR_SET(SRSS_CLK_FLL_CONFIG3, SRSS_CLK_FLL_CONFIG3_BYPASS_SEL, CY_SYSCLK_FLLPLL_OUTPUT_OUTPUT);
                        }
                        else
                        {
                            if (0U != (pllAutoModes & (uint16_t)(1UL << fllPll)))
                            {
                                CY_REG32_CLR_SET(SRSS_CLK_PLL_CONFIG[fllPll - 1UL], SRSS_CLK_PLL_CONFIG_BYPASS_SEL, CY_SYSCLK_FLLPLL_OUTPUT_AUTO);
                            }
                            else
                            {
                                CY_REG32_CLR_SET(SRSS_CLK_PLL_CONFIG[fllPll - 1UL], SRSS_CLK_PLL_CONFIG_BYPASS_SEL, CY_SYSCLK_FLLPLL_OUTPUT_OUTPUT);
                            }
                        }

                        retVal = CY_PRA_STATUS_SUCCESS;
                    }
                }
            }
        }
    }
    else if (Cy_SysClk_FllIsEnabled())
    {
        /* The timeout waits for FLL to regain a lock */
        while ((!Cy_SysClk_FllLocked()) && (0UL != timeout))
        {
            timeout--;
        }

        if (0UL != timeout)
        {
            /* Undoes the bypass for FLL */
            CY_REG32_CLR_SET(SRSS_CLK_FLL_CONFIG3, SRSS_CLK_FLL_CONFIG3_BYPASS_SEL, CY_SYSCLK_FLLPLL_OUTPUT_OUTPUT);
            retVal = CY_PRA_STATUS_SUCCESS;
        }
    }
    else
    {
        retVal = CY_PRA_STATUS_SUCCESS;
    }

    return (retVal);
}

/*******************************************************************************
* Function Name: Cy_PRA_RegAccessRangeValid
****************************************************************************//**
*
* Checks if the access is within the valid range and the access address is non-zero.
*
* \param index The index of the accessed register.
*
* \return Returns true for the valid access.
*
*******************************************************************************/
static bool Cy_PRA_RegAccessRangeValid(uint16_t index)
{
    bool accessValid = true;

    /* Checks if access is within the array range */
    if (index >= CY_PRA_REG_INDEX_COUNT)
    {
        accessValid = false;
    }
    else
    {
        /* Some registers do not exist for some families */
        if (regIndexToAddr[index].addr == (const volatile uint32_t *) 0U)
        {
            accessValid = false;
        }
    }

    return accessValid;
}


/*******************************************************************************
* Function Name: Cy_PRA_ClocksReset
****************************************************************************//**
*
* Initializes system clocks and dividers to the default state after reset.
*
*******************************************************************************/
static cy_en_pra_status_t Cy_PRA_ClocksReset(void)
{
    cy_en_pra_status_t returnStatus = CY_PRA_STATUS_SUCCESS;
    cy_en_sysclk_status_t sysClkStatus = CY_SYSCLK_SUCCESS;

    /* Sets the worst case memory wait states (! ultra low power, 150 MHz) */
    Cy_SysLib_SetWaitStates(false, CY_PRA_150MHZ_FREQUENCY);

    /* Resets the core clock path to default and disable all the FLLs/PLLs after Reset or Software reset */
    sysClkStatus = Cy_SysClk_ClkHfSetDivider(CY_PRA_CLKHF_0, CY_SYSCLK_CLKHF_NO_DIVIDE);
    if (CY_SYSCLK_SUCCESS != sysClkStatus)
    {
        returnStatus = CY_PRA_STATUS_ERROR_PROCESSING_CLKHF0;
    }

    /* Sets the default divider for FAST, PERI and SLOW clocks */
    Cy_SysClk_ClkFastSetDivider(CY_PRA_DIVIDER_0);
    Cy_SysClk_ClkPeriSetDivider(CY_PRA_DIVIDER_1);
    Cy_SysClk_ClkSlowSetDivider(CY_PRA_DIVIDER_0);

    SystemCoreClockUpdate();

    /* Disables All PLLs */
    if (CY_SRSS_NUM_PLL >= CY_PRA_CLKPLL_1)
    {
        sysClkStatus = Cy_SysClk_PllDisable(CY_PRA_CLKPLL_1);
    }

    if (CY_SYSCLK_SUCCESS != sysClkStatus)
    {
        returnStatus = CY_PRA_STATUS_ERROR_PROCESSING_PLL0;
    }

    if (CY_SRSS_NUM_PLL >= CY_PRA_CLKPLL_2)
    {
        sysClkStatus = Cy_SysClk_PllDisable(CY_PRA_CLKPLL_2);
    }

    if (CY_SYSCLK_SUCCESS != sysClkStatus)
    {
        returnStatus = CY_PRA_STATUS_ERROR_PROCESSING_PLL1;
    }

    /* Sets the CLK_PATH1 source to IMO */
    sysClkStatus = Cy_SysClk_ClkPathSetSource((uint32_t) CY_SYSCLK_CLKHF_IN_CLKPATH1, CY_SYSCLK_CLKPATH_IN_IMO);
    if (CY_SYSCLK_SUCCESS != sysClkStatus)
    {
        returnStatus = CY_PRA_STATUS_ERROR_PROCESSING_PATHMUX1;
    }

    /* Set the HF0 source to IMO if it is sourced from WCO */
    if (CY_SYSCLK_CLKHF_IN_CLKPATH0 == Cy_SysClk_ClkHfGetSource(CY_PRA_CLKHF_0))
    {
            if (CY_SYSCLK_CLKPATH_IN_WCO == Cy_SysClk_ClkPathGetSource((uint32_t) CY_SYSCLK_CLKHF_IN_CLKPATH0))
            {
                sysClkStatus = Cy_SysClk_ClkHfSetSource(CY_PRA_CLKHF_0, CY_SYSCLK_CLKHF_IN_CLKPATH1);
                if (CY_SYSCLK_SUCCESS != sysClkStatus)
                {
                    returnStatus = CY_PRA_STATUS_ERROR_PROCESSING_CLKHF0;
                }
                SystemCoreClockUpdate();
            }
    }

    sysClkStatus = Cy_SysClk_FllDisable();
    if (CY_SYSCLK_SUCCESS != sysClkStatus)
    {
        returnStatus = CY_PRA_STATUS_ERROR_PROCESSING_FLL0;
    }

