RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/source/cy_pra.c
    /* Sets the CLK_PATH0 source to IMO */
    sysClkStatus = Cy_SysClk_ClkPathSetSource((uint32_t) CY_SYSCLK_CLKHF_IN_CLKPATH0, CY_SYSCLK_CLKPATH_IN_IMO);
    if (CY_SYSCLK_SUCCESS != sysClkStatus)
    {
        returnStatus = CY_PRA_STATUS_ERROR_PROCESSING_PATHMUX0;
    }

    /* Sets the HF0 source to IMO via CLK_PATH0 */
    sysClkStatus = Cy_SysClk_ClkHfSetSource(CY_PRA_CLKHF_0, CY_SYSCLK_CLKHF_IN_CLKPATH0);
    if (CY_SYSCLK_SUCCESS != sysClkStatus)
    {
        returnStatus = CY_PRA_STATUS_ERROR_PROCESSING_CLKHF0;
    }

    #ifdef CY_IP_MXBLESS
        Cy_BLE_EcoReset();
    #endif

    return returnStatus;
}


/*******************************************************************************
* Function Name: Cy_PRA_BackupReset
****************************************************************************//**
*
* Resets the Backup domain and system clocks after System reset.
*
*******************************************************************************/
static cy_en_pra_status_t Cy_PRA_BackupReset(bool iloHibernateON)
{
    cy_en_pra_status_t returnStatus = CY_PRA_STATUS_SUCCESS;

    if (CY_SYSLIB_SUCCESS != Cy_SysLib_ResetBackupDomain())
    {
        returnStatus = CY_PRA_STATUS_ERROR_PROCESSING_PWR;
    }
    else
    {
        if (Cy_SysClk_IloIsEnabled())
        {
            if (CY_SYSCLK_SUCCESS != Cy_SysClk_IloDisable())
            {
                returnStatus = CY_PRA_STATUS_ERROR_PROCESSING_PWR;
            }
        }

        if (CY_PRA_STATUS_SUCCESS == returnStatus)
        {
            Cy_SysClk_IloEnable();
            Cy_SysClk_IloHibernateOn(iloHibernateON);
        }
    }

    return returnStatus;
}

/*******************************************************************************
* Function Name: Cy_PRA_ValidateSramPowerMode
****************************************************************************//**
*
* Validate SRAM power mode for a particular macro.
*
*******************************************************************************/
static cy_en_pra_status_t Cy_PRA_ValidateSramPowerMode(cy_en_syspm_sram_index_t sramNum, uint32_t sramMacroNum, cy_en_syspm_sram_pwr_mode_t sramPwrMode)
{
    uint32_t macroConfigIndex;
    cy_en_pra_status_t praStatus = CY_PRA_STATUS_SUCCESS;

    if (((uint8_t)sramNum < CY_PRA_SRAM_MAX_NR) && ((uint8_t)sramMacroNum < CY_PRA_SRAM_MACRO_MAX_NR))
    {
        /* find the sram macro */
        for (macroConfigIndex=0UL; macroConfigIndex<sramPwrModeConfig[sramNum].macroConfigCount; macroConfigIndex++)
        {
            if (0UL != (sramPwrModeConfig[sramNum].macroConfigs[macroConfigIndex].sramMacros & (1UL<<sramMacroNum)))
            {
                switch(sramPwrMode)
                {
                    case CY_SYSPM_SRAM_PWR_MODE_OFF:
                    if (0U == _FLD2VAL(CY_PRA_PM_SRAM_PWR_MODE_OFF, sramPwrModeConfig[sramNum].macroConfigs[macroConfigIndex].sramPwrMode))
                    {
                        praStatus = CY_PRA_STATUS_INVALID_PARAM;
                    }
                    break;
                    case CY_SYSPM_SRAM_PWR_MODE_RET:
                    if (0U == _FLD2VAL(CY_PRA_PM_SRAM_PWR_MODE_RETAIN, sramPwrModeConfig[sramNum].macroConfigs[macroConfigIndex].sramPwrMode))
                    {
                        praStatus = CY_PRA_STATUS_INVALID_PARAM;
                    }
                    break;
                    case CY_SYSPM_SRAM_PWR_MODE_ON:
                    if (0U == _FLD2VAL(CY_PRA_PM_SRAM_PWR_MODE_ON, sramPwrModeConfig[sramNum].macroConfigs[macroConfigIndex].sramPwrMode))
                    {
                        praStatus = CY_PRA_STATUS_INVALID_PARAM;
                    }
                    break;
                    default:
                    /* invalid power mode */
                    break;
                }
                break; /* found the macro number */
            }
        }

        /* if configuration is not present in policy, then all power modes are allowed */
    }
    else
    {
        praStatus = CY_PRA_STATUS_INVALID_PARAM;
    }

    return praStatus;
}

/*******************************************************************************
* Function Name: Cy_PRA_ValidateEntireSramPowerMode
****************************************************************************//**
*
* Validate SRAM power mode for all macros.
*
*******************************************************************************/
static cy_en_pra_status_t Cy_PRA_ValidateEntireSramPowerMode(cy_en_syspm_sram_index_t sramNum, cy_en_syspm_sram_pwr_mode_t sramPwrMode)
{
    uint32_t macroConfigIndex;
    cy_en_pra_status_t praStatus = CY_PRA_STATUS_SUCCESS;

    if ((uint8_t)sramNum < CY_PRA_SRAM_MAX_NR)
    {
        /* find the sram macro */
        for (macroConfigIndex=0UL; macroConfigIndex<sramPwrModeConfig[sramNum].macroConfigCount; macroConfigIndex++)
        {
            switch(sramPwrMode)
            {
                case CY_SYSPM_SRAM_PWR_MODE_OFF:
                if (0U == _FLD2VAL(CY_PRA_PM_SRAM_PWR_MODE_OFF, sramPwrModeConfig[sramNum].macroConfigs[macroConfigIndex].sramPwrMode))
                {
                    praStatus = CY_PRA_STATUS_INVALID_PARAM;
                }
                break;
                case CY_SYSPM_SRAM_PWR_MODE_RET:
                if (0U == _FLD2VAL(CY_PRA_PM_SRAM_PWR_MODE_RETAIN, sramPwrModeConfig[sramNum].macroConfigs[macroConfigIndex].sramPwrMode))
                {
                    praStatus = CY_PRA_STATUS_INVALID_PARAM;
                }
                break;
                case CY_SYSPM_SRAM_PWR_MODE_ON:
                if (0U == _FLD2VAL(CY_PRA_PM_SRAM_PWR_MODE_ON, sramPwrModeConfig[sramNum].macroConfigs[macroConfigIndex].sramPwrMode))
                {
                    praStatus = CY_PRA_STATUS_INVALID_PARAM;
                }
                break;
                default:
                /* invalid power mode */
                break;
            }
            if (praStatus == CY_PRA_STATUS_INVALID_PARAM)
            {
                break;
            }
        }

        /* if configuration is not present in policy, then all power modes are allowed */
    }
    else
    {
        praStatus = CY_PRA_STATUS_INVALID_PARAM;
    }

    return praStatus;
}

#endif /* (CY_CPU_CORTEX_M0P) */

CY_MISRA_BLOCK_END('MISRA C-2012 Rule 17.2');

#endif /* (CY_DEVICE_SECURE) */

#endif /* CY_IP_M4CPUSS */

/* [] END OF FILE */
